Repository: NAStools/gateone
Catalog: gateone/i18n/*/LC_MESSAGES/gateone_js.po
Languages: ru_ru

source: Synchronization Complete
ru_ru: Синхронизация завершена

source: Missing bookmark icons will be retrieved in the background
ru_ru: Недостающие значки закладок будут загружены в фоновом режиме

source: First-Time Synchronization Complete
ru_ru: Первая синхронизация завершена

source: tags were renamed.
ru_ru: тагов было переименовано.

source: bookmarks were deleted or marked as such.
ru_ru: закладок было удалено или помечено на удаление

source: Submit
ru_ru: Отправить

source: Cancel
ru_ru: Отмена

source: Save
ru_ru: Сохранить

source: Go
ru_ru: Вперед

source: Are you sure you wish to delete this identity?
ru_ru: Вы уверены, что хотите удалить эту identity?

source: An X.509 certificate may be uploaded to add to this identity. If one already exists, the existing certificate will be overwritten.
ru_ru: Сертификат X.509 может быть загружен для добавления к данной identity. Если он уже существует, существующий сертификат будет перезаписан.

source: The private key for this SSH identity is protected by a passphrase. Please enter the passphrase so a public key can be generated.
ru_ru: Cекретный ключ для этой SSH identity защищен ключевой фразой. Пожалуйста, введите ключевую фразу для создания открытого ключа.

source: <b>NOTE:</b> This passphrase will only be used to extract the public key and will not be stored.
ru_ru: <b> ПРИМЕЧАНИЕ: </b> Эта ключевая фраза будет использована только для извлечения открытого ключа и не будет сохранена.

source: Passphrase
ru_ru: Ключевая фраза

source: Terminal output has been suspended (Ctrl-S). Type Ctrl-Q to resume.
ru_ru: Вывод терминала был приостановлен (Ctrl-S). Нажмите Ctrl-Q для возобновления.

source: WARNING: Problematic Browser Extension Detected
ru_ru: ПРЕДУПРЕЖДЕНИЕ: Обнаружено проблемное расширение браузера

source: <p><b>Warning:</b> An extension was detected that can result in a severe negative impact on terminal performance (Google Voice). The extension is modifying the web page every time there's a screen update (what it thinks are phone numbers are being converted into clickable links). Please disable the 'Clickable Links' feature of the extension, turn it off for this web site (if possible), or disable it entirely.</p>
ru_ru: <p> <b> Предупреждение: </b> было обнаружено расширение, которое может привести к серьезным негативным последствиям для производительности (Google Voice). Это расширение модифицирует страницу при каждом обновлении экрана. Пожалуйста, отключите в нем опцию 'Clickable Links' либо отключите расширение для данного сайта (или совсем).</p>

source: Click to edit. Leave blank for default.
ru_ru: Нажмите для редактирования. Оставьте пустым для значения по умолчанию.

source: <b>Connected Since:</b>
ru_ru: <b>Подсоединен с:</b>

source: <b>Rows:</b>
ru_ru: <b>Строки:</b>

source: <b>Columns:</b>
ru_ru: <b>Колонки:</b>

source: <b>Backspace Key:</b>
ru_ru: <b>Клавиша Backspace:</b>

source: <b>Encoding:</b>
ru_ru: <b>Кодировка:</b>

source: <b>Keyboard Mode</b>
ru_ru: <b>Режим клавиатуры</b>

source: Monitor for Activity<br />
ru_ru: Монитор для активности<br />

source: Monitor for
ru_ru: Монитор для

source: Seconds of Inactivity
ru_ru: Секунд простоя

source: Now monitoring for inactivity in terminal:
ru_ru: Теперь наблюдаю простой в терминале:

source: Terminal Sharing
ru_ru: Общий терминал

source: Opens up the terminal sharing control panel for this terminal.
ru_ru: Открывает панель управления общим терминалом для этого терминала

source: Rescue Terminal
ru_ru: Спасти терминал

source: Attempts to rescue a hung terminal by performing a terminal reset; the equivalent of executing the 'reset' command.
ru_ru: Попытка спасти зависший терминал при помощи сброса терминала. Эквивалент запуска команды 'reset'.

source: Attempting to download our WebWorker...
ru_ru: Попытка загрузить наш WebWorker

source: <b>Font:</b>
ru_ru: <b>Шрифт:</b>

source: <b>Font Size:</b>
ru_ru: <b>Размер шрифта:</b>

source: <b>Color Scheme:</b>
ru_ru: <b>Цветовая схема:</b>

source: <b>Disable Selected Text Highlighting:</b>
ru_ru: <b>Отключить подсветку выделенного текста:</b>

source: <b>Disable Bell Sound:</b>
ru_ru: <b>Отключить звук терминала:</b>

source: Configure
ru_ru: Настроить

source: <b>Bell Sound:</b>
ru_ru: <b>Звук терминала:</b>

source: <b>Scrollback Buffer Lines:</b>
ru_ru: <b>Строк в буфере экрана:</b>

source: <b>Terminal Rows:</b>
ru_ru: <b>Строк в терминале:</b>

source: <b>Terminal Columns:</b>
ru_ru: <b>Колонок в терминале:</b>

source: monospace (let browser decide)
ru_ru: моноширинный (пусть браузер решает)

source: Use GateOne.Events.on('terminal:send_dimensions', func) instead.
ru_ru: Используйте вместо этого GateOne.Events.on('terminal:send_dimensions', func).

source: Backspace difference detected; switching to ^?
ru_ru: Обнаружено изменение кода стирания символа: переключаюсь на ^?

source: Backspace difference detected; switching to ^H
ru_ru: Обнаружено изменение кода стирания символа: переключаюсь на ^H

source: Use GateOne.Events.on('terminal:term_updated', func) instead.
ru_ru: Используйте вместо этого GateOne.Events.on('terminal:term_updated', func).

source: WARNING: The rate limiter was engaged on terminal:
ru_ru: ПРЕДУПРЕЖДЕНИЕ: В терминале включено ограничение скорости:

source: . Output will be severely slowed until you press a key (e.g. Ctrl-C).
ru_ru: . Вывод будет серьезно замедлен, пока вы не нажмете что-то (например Ctrl-C).

source: Use GateOne.Events.on('terminal:new_terminal', func) instead.
ru_ru: Используйте вместо этого GateOne.Events.on('terminal:new_terminal', func).

source: Use GateOne.Events.on('terminal:term_closed', func) instead.
ru_ru: Используйте вместо этого GateOne.Events.on('terminal:term_closed', func).

source: GateOne.Terminal.setTerminal() got an invalid term number:
ru_ru: GateOne.Terminal.setTerminal() получил неправильный номер терминала:

source: Terminal Application Panel
ru_ru: Панель приложения терминала

source: Upload Bell Sound
ru_ru: Загрузить звук термниала

source: Terminal:
ru_ru: Терминал:

source: has been relocated to location:
ru_ru: перемещен в местоположение:

source: Deleting scollback buffer for non-existent terminal:
ru_ru: Удаляю буфер экрана для несуществующего терминала:

source: Use GateOne.Events.on('terminal:term_reattach', func) instead.
ru_ru: Используйте вместо этого GateOne.Events.on('terminal:term_reattach', func).

source: <p style="width: 18em;">Words or phrases you would like to remain persistently highlighted in terminals</p>
ru_ru: <p style="width: 18em;">Слова или фразы, котрые вы хотите видеть постоянно подсвеченными в терминалах</p>

source: <a onclick="GateOne.Terminal.unhighlightWord();">Remove</a>
ru_ru: <a onclick="GateOne.Terminal.unhighlightWord();">Удалить</a>

source: Word Highlighting
ru_ru: Подсветка слов

source: <thead><tr class='✈table_row'><th>Word</th><th>Global</th><th>Remove</th></tr></thead>
ru_ru: <thead><tr class='table_row'><th>Слово</th><th>Глобально</th><th>Удалить</th></tr></thead>

source: Terminal Output Suspended
ru_ru: Вывод терминала приостановлен

source: Anyone (Broadcast)
ru_ru: Всем (широковещательное)

source: Authenticated Users
ru_ru: Авторизованные пользователи

source: The Share ID is used to generate the broadcast URL.
ru_ru: Данный общий ID использован при создании широковещательного URL.

source: Generate a new share ID (the last part of the broadcast URL)
ru_ru: Создать новый общий ID (последняя часть широковещательного URL)

source: User
ru_ru: Пользователь

source: IP Address
ru_ru: IP адрес

source: Read
ru_ru: Чтение

source: Write
ru_ru: Запись

source: Terminal Sharing:
ru_ru: Общий терминал:

source: Terminal is no longer shared:
ru_ru: Терминал больше не является общим

source: Share ID:
ru_ru: Общий ID:

source: Broadcast URL:
ru_ru: Широковещательный URL:

source: Password:
ru_ru: Пароль:

source: Apply
ru_ru: Применить

source: Done
ru_ru: Закончить

source: Generate New Share ID
ru_ru: Создать новый общий ID

source: Shared terminals are available (click the magnifying glass icon).
ru_ru: Доступны общие терминалы (кликните по значку лупы))

source: Owner
ru_ru: Владелец

source: Title
ru_ru: Заголовок

source: Write Access
ru_ru: Доступ на запись

source: Password
ru_ru: Пароль

source: View
ru_ru: Вид

source: Error: You must enter a password to view this shared terminal
ru_ru: ОшибкаЖ Вы должны указать пароль для просмотра общего терминала

source: Shared Terminals
ru_ru: Общие терминалы

source: Authenticated
ru_ru: Авторизованные

source: Terminal Viewers:
ru_ru: Терминал смотрят:

source: Settings
ru_ru: Параметры

source: Terminal Sharing Info
ru_ru: Инфо об общем терминале

source: Viewers:
ru_ru: Зрители:

source: Text copied to clipboard.
ru_ru: Текст скопирован в буфер.

source: NOTE: Rapidly pressing F11 twice will enable/disable fullscreen mode.
ru_ru: ЗАМЕТКА: Быстрое двойное нажатие F11 включает/выключает полноэкранный режим.

source: Ninja Mode disabled.
ru_ru: Режим ниндзя выключен.

source: Ninja Mode! Gate One has become hidden.
ru_ru: Режим ниндзя! Gate One скрыт.

source: Browser does not support Web Worker transferable objects. X11 performance will be (slightly) reduced.
ru_ru: Браузер не поддерживает передаваемые объекты Web-Worker. Производительность X11 будет (немного) уменьшена

source: CodeMirror editor mode could not be found:
ru_ru: Режим редактирования CodeMirror не найден:

source: Specified CodeMirror mode is invalid:
ru_ru: Неправильный режим CodeMirror:

source: Took too long waiting for the given CodeMirror mode.
ru_ru: Ожидание режима CodeMirror заняло слишком много времени.

source: Gate One Help
ru_ru: Справка Gate One

source: Contents
ru_ru: Содержание

source: About Gate One
ru_ru: О продукте

source: Gate One's Documentation
ru_ru: Документация Gate One

source: <b>Gate One Help:</b>
ru_ru: <b>Справка Gate One:</b>

source: <b>Version:</b>
ru_ru: <b>Версия:</b>

source: Gate One is a web-based application gateway...
ru_ru: Gate One - это веб-шлюз для приложений...

source: Dismiss
ru_ru: Закрыть

source: Welcome to Gate One
ru_ru: Добро пожаловать в Gate One

source: Haven't implemented the DOM option in this function yet, sorry!
ru_ru: Извините, функции данного элемента DOM пока не реализованы!

source: Browser failed WebSocket support check.
ru_ru: Браузер не прошел тест на поддержку WebSocket.

source: Sorry but your web browser does not appear to support WebSockets. Gate One requires WebSockets in order to (efficiently) communicate with the server.
ru_ru: К сожалению, похоже, ваш браузер не поддерживает WebSockets. Gate One требуется WebSockets для того, чтобы (эффективно) общаться с сервером.

source: Browser failed Blob support check.
ru_ru: Браузер не прошел тест на поддержку Blob.

source: Browser failed window.URL object support check.
ru_ru: Браузер не прошел тест на поддержку window.URL

source: Your browser does not appear to support the <a href='https://developer.mozilla.org/en-US/docs/DOM/window.URL.createObjectURL'>window.URL</a> object. Some features related to saving files will not work.
ru_ru: Похоже, ваш браузер не поддерживает свойство <a href='https://developer.mozilla.org/en-US/docs/DOM/window.URL.createObjectURL'>window.URL</a>. Некоторые функции, связанные с сохранением файлов, не будут работать.

source: Sorry but your browser is missing the following capabilities which are required to run Gate One: Gate One will not be loaded.
ru_ru: К сожалению, ваш браузер не поддерживает некоторые функции, необходимые для запуска Gate One: Gate One не будет загружен.

source: Don't display this warning again
ru_ru: Больше не показывать это предупреждение

source: Using API authentiation object:
ru_ru: Использую объект API аутентификации:

source: Preferences
ru_ru: Настройки

source: <b>Theme:</b>
ru_ru: <b>Тема:</b>

source: <b>Disable CSS3 Transitions:</b>
ru_ru: <b>Отключить CSS3 переходы:</b>

source: Application could not be found:
ru_ru: Приложение не найдено:

source: Application does not have a __new__() method:
ru_ru: У приложения нет метода __new__():

source: ms, Average:
ru_ru: мс, Среднее:

source: Error loading stylesheet:
ru_ru: Ошибка при загрузке таблицы стилей

source: No log destination named:
ru_ru: Не указано назначение логов:

source: A keepalive ping has timed out. Attempting to reconnect...
ru_ru: Таймаут попытки пинга. Пытаюсь восстановить соединение...

source: Use GateOne.Terminal.Input.sendChars() instead.
ru_ru: Используйте вместо этого GateOne.Terminal.Input.sendChars().

source: Use GateOne.Terminal.sendString() instead.
ru_ru: Используйте вместо этого GateOne.Terminal.sendString().

source: Pinging Gate One server took longer than
ru_ru: Пинг сервера Gate One занял более

source: ms. Attempting to reconnect...
ru_ru: мс. Пытаюсь восстановить соединение...

source: PONG: Gate One server round-trip latency:
ru_ru: ОТВЕТ: время ответа сервера Gate One:

source: Authentication Failure
ru_ru: В доступе отказано

source: The authentication object was denied by the server. Click OK to reload the page.
ru_ru: Объект аутентификации не принят сервером. Нажмите OK для обновления страницы.

source: Use GateOne.Terminal.sendDimensions() instead.
ru_ru: Используйте вместо этого GateOne.Terminal.sendDimensions().

source: Attempting to connect to the Gate One server...
ru_ru: Попытка соединения с сервером Gate One...

source: An SSL certificate must be accepted by your browser to continue. Please click <a href='' target='_blank'>here</a> to be redirected.
ru_ru: SSL сертификат должен быть установлен в вашем браузере. Нажмите <a href='' target='_blank'>здесь</a> для перехода.

source: WebSocket Closed
ru_ru: WebSocket закрыт

source: The WebSocket has been disconnected.
ru_ru: Данный WebSocket отсоединен.

source: <b>Message From Gate One Server:</b>
ru_ru: <b>Сообщение от сервера Gate One:</b>

source: Your session has timed out. Reload the page to reconnect to Gate One.
ru_ru: Ваша сессия устарела. Обновите страницу для повторного соединения с Gate One.

source: Use GateOne.Terminal.setTerminal() instead.
ru_ru: Используйте вместо этого GateOne.Terminal.setTerminal().

source: Use GateOne.Terminal.killTerminal() instead.
ru_ru: Используйте вместо этого GateOne.Terminal.killTerminal().

source: Use GateOne.Terminal.refresh() instead.
ru_ru: Используйте вместо этого GateOne.Terminal.refresh().

source: Use GateOne.Terminal.fullRefresh() instead.
ru_ru: Используйте вместо этого GateOne.Terminal.fullRefresh().

source: Location
ru_ru: Местоположение

source: Application(s)
ru_ru: Приложения

source: Locations
ru_ru: Местоположения

source: Skipping adding the icon for
ru_ru: Не добавляю значок для

source: . Took too long to load dependencies.
ru_ru: . Загрузке зависимостей заняла слишком много времени.

source: New Workspace Workspace
ru_ru: Новое рабочее место

source: New Workspace - Applications
ru_ru: Новое рабочее место - Приложения

source: Failed to load database:
ru_ru: Ошибка загрузки БД:

source: does not exist in:
ru_ru: не существует в:

source: Deleting expired file:
ru_ru: Удаляю устаревший файл:

source: is cached but is older than what's on the server. Requesting an updated version...
ru_ru: загружен, но старше того, что находится на сервере. Запрашиваю обновленную версию...

source: This file requires a certain script be loaded first:
ru_ru: Перед использованием этого файла требуется загрузить некоторый скрипт:

source: Failed to load
ru_ru: Ошибка загрузки

source: . Took too long waiting for:
ru_ru: . Превышено время ожидания:

source: is not cached. Requesting...
ru_ru: не загружен. Запрашиваю...

source: You must create a database model before creating a new database.
ru_ru: Перед созданием БД нужно создать модель БД.

source: Removing obsolete object store (self-cleanup):
ru_ru: Удаляю устаревшие объекты из реестра (автоочистка):

source: database creation/upgrade complete
ru_ru: создание/обновление БД закончено

source: : The database needs to be created or updated. Creating/upgrading database...
ru_ru: : Требуется создать или обновить БД. Делаю это...

source: Please close other tabs connected to this server and reload this page so we may upgrade the IndexedDB database.
ru_ru: Пожалуйста, закройте остальные вкладки, соединенные с данным сервером и обновите страницу, чтобы мы обновили БД IndexedDB.

source: GateOne.Storage.openDB(): No database upgrade necessary. Calling callback...
ru_ru: GateOne.Storage.openDB(): Обновление БД не требуется. Вызов события...

source: GateOne.Storage.openDB(): IndexedDB is unavailable. Falling back to localStorage...
ru_ru: GateOne.Storage.openDB(): IndexedDB недоступна. Возвращаюсь к localStorage...

source: Clearing entire indexedDB:
ru_ru: Полностью очищаю indexedDB:

source: Clearing indexedDB store:
ru_ru: Очищаю реестр indexedDB:

source: store deleted
ru_ru: реестр удален

source: database deleted
ru_ru: БД удалена

source: Use GateOne.Events.on('go:user_login', func) instead.
ru_ru: Используйте вместо этого Use GateOne.Events.on('go:user_login', func).

source: Logout Response:
ru_ru: Отклик на попытку выхода:

source: You have been logged out. Redirecting to:
ru_ru: Вы вышли. Перенаправление на:

source: Events now use prefixes such as 'go:' or 'terminal:'.
ru_ru: Теперь события используют префиксы типа 'go:' или 'terminal:'.

source: Application, '' could not be found.
ru_ru: Приложение '' не найдено.

source: Application, '' does not have a __new__() method.
ru_ru: В приложении '' нет метода __new__().

source: Overwriting existing shortcut for:
ru_ru: Перезаписываю существующее сочетание клавиш для:

source: Error getting em dimensions (probably just a hidden terminal):
ru_ru: Ошибка при получении размера в em (вероятно, просто невидимый терминал):

source: JavaScript Load Error
ru_ru: Ошибка загрузки JavaScript

source: This can happen if you haven't accepted Gate One's SSL certificate yet. Click OK to open a new tab/window where you can accept the Gate One server's SSL certificate. If the page doesn't load it means the Gate One server is currently unavailable.
ru_ru: Это могло случиться, если вы еще не добавили в браузер SSL сертификат Gate One. Нажмите ОК для открытия вкладки, в которой вы сможете добавить сертификат сервера Gate One. Если страница не загрузится, значит сервер Gate One в данный момент недоступен.

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: GateOne.Visual.table(): You must pass in settings['id'] to this function.
ru_ru: GateOne.Visual.table(): Вы должны передать settings['ID'] в эту функцию.
